In [1]:
import pandas as pd

In [2]:
'l1 l2 l3 l4'.split()

['l1', 'l2', 'l3', 'l4']

In [3]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (9, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [16]:
type(df)

pandas.core.frame.DataFrame

In [15]:
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   9  10  11  12

In [18]:
df[['c1', 'c2']]

    c1  c2
l1   1   2
l2   5   6
l3   9  10
l4  13  14

In [19]:
df[1:2][['c1', 'c2']]

    c1  c2
l2   5   6

In [20]:
df.loc['l3']

c1     9
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [26]:
df.loc[['l2', 'l1']]

    c2  c3
l1   2   3
l4  14  15

In [27]:
df.loc[['l1', 'l4'], ['c2', 'c3']]

    c2  c3
l1   2   3
l4  14  15

In [28]:
df.iloc[[1, 0], [2, 3]]

    c3  c4
l2   7   8
l1   3   4